# <center>Blank and duplicate values</center>

In [1]:
import pandas as pd
import numpy as np

In [3]:
product_df =pd.DataFrame({'product':[np.nan,'dairy','dairy',np.nan,'fruits'],
                          'price':[2.3,np.nan,4.55,2.74,np.nan]})

In [4]:
product_df

  product  price
0     NaN   2.30
1   dairy    NaN
2   dairy   4.55
3     NaN   2.74
4  fruits    NaN

In [5]:
#to indentify missing values use isna() and sum()

product_df.isna().sum()

product    2
price      2
dtype: int64

In [6]:
product_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   product  3 non-null      object
 1   price    3 non-null      float64
dtypes: float64(1), object(1)
memory usage: 208.0+ bytes

In [7]:
#to handle missing data dropna() and fillna() methods are used
#either remove them from dataframe or replace them with other values

product_df

  product  price
0     NaN   2.30
1   dairy    NaN
2   dairy   4.55
3     NaN   2.74
4  fruits    NaN

In [12]:
mean = product_df['price'].mean()
median = product_df['price'].median()


product_df.fillna({'price':median})

  product  price
0     NaN   2.30
1   dairy   2.74
2   dairy   4.55
3     NaN   2.74
4  fruits   2.74

In [10]:
median = product_df['price'].median()

In [11]:
median

2.74

In [13]:
product_df

  product  price
0     NaN   2.30
1   dairy    NaN
2   dairy   4.55
3     NaN   2.74
4  fruits    NaN

In [14]:
product_df.fillna({'product':'cake'})

  product  price
0    cake   2.30
1   dairy    NaN
2   dairy   4.55
3    cake   2.74
4  fruits    NaN